{"pages":[{"title":"about","text":"","link":"/about/index.html"},{"title":"musings","text":"","link":"/musings/index.html"},{"title":"projects","text":"","link":"/projects/index.html"},{"title":"categories","text":"","link":"/categories/index.html"}],"posts":[{"title":"AVEflex","text":"AVEflex is a flexible printed circuit board (FPC) for relocating the Audio-Video Encoder (AVE) on 4-layer Wii motherboards. Supported revisions include RVL-CPU-40 RVL-CPU-50 RVL-CPU-60 RVK-CPU-01 RVK-CPU-02 The FPC breaks out all analog signals generated by the AVE: YPbPr/RGBHV, composite video, and stereo line level audio. There’s also a solder jumper for the Wii’s MODE pin, so you can easily connect MODE to 3.3V to enable progressive component or VGA. AssemblyThe AVE is removed from the donor Wii with hot air. It has a thermal pad and takes quite a bit of heat to remove. Applying force to the AVE during the removal is a bad idea, as its pins are quite fragile and bend easily. The AVE is then hotaired back onto the flex board to connect the thermal pad under the IC. Passives can either be harvested from the Wii motherboard, or you can use new components. I choose to buy new passives so I don’t have to bother desoldering the originals. The FPC requires: x9 0402 0.1uF x1 0402 10nF x1 0603 10uF x1 0603 4.7uF x4 0402 75Ω x1 0402 1.2kΩ. Here’s my Mouser Project with the BOM. There’s an extra 270kΩ resistor for the AVE’s POR RC circuit in the BOM, but I’m testing the AVE without said POR circuit to make assembly simpler. Reference the RVK Compendium and JacksonS’s component value measurements in Shank’s Wii Super Thread for component placement. As the silk message on the underside of the board states, if you’re using a standalone I2S audio amp for your project and don’t need analog audio from the AVE, you can carefully trim off the top 4 vias (marked in white) on the FPC to expose them, and disconnect the AVE from the I2S bus. If you decide to do this, make sure you do not sever the SCL trace on the underside of the FPC, or the AVE will not be initialized properly. Something I’ve noticed is that there are two distinct colors of Wii motherboards. Some have dark green soldermask and untented vias, and some have olive-green mask and tented vias. I prefer to use the dark green boards for OMEGA trims, because the untented vias make soldering and relocations easier. Also, the dark green boards are prettier than the olive-green ones. The dark green mobos usually have an “FB” label near the RTC battery, and the olive-green mobos have a “CS” label.","link":"/2020/09/25/aveflex/"}],"tags":[],"categories":[]}